---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.SharedCoordinatesFailures
source: html/7a79e637-ee94-b4b9-fd35-18476e70f3cd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SharedCoordinatesFailures

Failures about shared coordinates.

## Syntax (C#)
```csharp
public static class SharedCoordinatesFailures
```